# SetTileOffsetPoint

## Description
Sets the specified tile resource's offset point.

```pascal
PROCEDURE SetTileOffsetPoint(
				tileHandle  : HANDLE;
				offsetPoint : REAL);
```

```python

def vs.SetTileOffsetPoint(tileHandle, offsetPoint):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|tileHandle|HANDLE|The tile resource in which to set the offset point.|
|offsetPoint|REAL|The offsets point to be set.|

## Examples
```pascal
SetTileRepetitionPoint(tileHandle, offsetPoint);
```

## See Also
VS Functions:
CreateTile| ShowEditTileDialog| ShowEditTileSettingsDialog| ShowNewTileDialog| GetTileGeometryGroup| BeginGroupN| AddTileGeometryObject| GetTileGroupParent| IsTileGroupContainedObject| GetTileBackgroundColor| SetTileBackgroundColor| GetTileRepetitionPoint| SetTileRepetitionPoint| GetTileOffsetPoint| SetTileOffsetPoint

## Version
Availability: from Vectorworks 2011
## Category
* Document Attributes